app/views/WebService/subscribetemplate.xml

<?xml version="1.0" encoding="UTF-8"?><soap-env:Envelope xmlns:soap-env="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsd="http://www.w3.org/1999/XMLSchema" xmlns:xsi="http://www.w3.org/1999/XMLSchema-instance"><soap-env:Body><wsnt:Subscribe xmlns:wsnt="http://docs.oasis-open.org/wsn/b-2"><wsnt:ConsumerReference><wsa:Address xmlns:wsa="http://www.w3.org/2005/08/addressing">${subscriber}</wsa:Address><wsa:ReferenceParameters xmlns:wsa="http://www.w3.org/2005/08/addressing"/></wsnt:ConsumerReference><wsnt:Filter><wsnt:TopicExpression xmlns:${topicPrefix}="${topicURI}" Dialect="http://www.w3.org/TR/1999/REC-xpath-19991116">${topicPrefix}:${topicName}</wsnt:TopicExpression></wsnt:Filter></wsnt:Subscribe></soap-env:Body></soap-env:Envelope>